Revit 2024 API
PointCloudOverrides.SetPointCloudRegionOverrideSettings Method (ElementId, PointCloudOverrideSettings)
 Assigns region override settings to the whole PointCloudInstance element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetPointCloudRegionOverrideSettings(
	ElementId elementId,
	PointCloudOverrideSettings newSettings
)
Visual Basic
Public Sub SetPointCloudRegionOverrideSettings ( _
	elementId As ElementId, _
	newSettings As PointCloudOverrideSettings _
)
Visual C++
public:
void SetPointCloudRegionOverrideSettings(
	ElementId^ elementId,
	PointCloudOverrideSettings^ newSettings
)
Parameters
elementId
Type: Autodesk.Revit.DB.ElementId
 Id of the element to be overridden.
newSettings
Type: Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings
 Override settings to be assigned.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PointCloudOverrides Class
SetPointCloudRegionOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace